* DONE Add sensible binding for project specific todo captures 
  :LOGBOOK:
  CLOCK: [2019-10-20 Sun 23:19]--[2019-10-20 Sun 23:22] =>  0:03
  :END:
* DONE Install and configure org-reveal
** DONE Install org-reveal
** DONE Configure org-reveal
* DONE Add org-bullets plugin for fancy bullets
  :LOGBOOK:
  CLOCK: [2019-10-24 Thu 23:04]--[2019-10-24 Thu 23:08] =>  0:04
  CLOCK: [2019-10-24 Thu 23:01]--[2019-10-24 Thu 23:04] =>  0:03
  :END:
* DONE Add pdf-tools plugin
* DONE Decide if all-the-icons package is needed
* DONE Install treemacs
* DONE Install doom-modeline
* DONE modify agenda binding to have 'go tos' nested binding
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 20:50]--[2019-11-06 Wed 20:55] =>  0:05
  :END:
* DONE add clock in and out functionality
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 20:56]--[2019-11-06 Wed 21:04] =>  0:08
  :END:
* DONE use counsel to list recent project todos to select for clock-in
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 21:32]--[2019-11-06 Wed 21:32] =>  0:00
  :END:
* DONE change p to projectile
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 21:38]--[2019-11-06 Wed 21:38] =>  0:00
  :END:
* DONE add hide functionality
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 21:40]--[2019-11-06 Wed 21:45] =>  0:05
  :END:
* DONE Install Ace-jump
* DONE Fix counsel-projectile bindings
* DONE add nerd commenter package
  :LOGBOOK:
  CLOCK: [2019-11-06 Wed 22:13]--[2019-11-06 Wed 22:13] =>  0:00
  CLOCK: [2019-11-06 Wed 22:00]--[2019-11-06 Wed 22:13] =>  0:13
  :END:
* DONE add help functionality
* TODO Decide if org-noter is desired
* TODO Figure out music player in emacs
* TODO Decide of browser is worth while
* TODO Decide if email client is worth while
